app/views/roadmaps/index.html.erb

SELECT `arbeitspaketvorgaengers`.* FROM `arbeitspaketvorgaengers` WHERE (apid = 1)
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 1)
---
      <% @aplist.each do |ap| %>
        <% @vorgaenger = Arbeitspaketvorgaenger.find(:all, :conditions => [ "apid = ?", ap]) %>
        <% if @vorgaenger.empty? %> <!-- Wenn kein Vorgaenger, dann Erste AP -->
            <% @erste_ap = Arbeitspaket.find(:all, :conditions => [ "id = ?", ap]) %>

SELECT `arbeitspakets`.* FROM `arbeitspakets`
---
              <%if !@apdauer.first.nil? %>
                <% @faz_temp = @fazVorgaenger + @apdauer.first.arbeitspaketdauer %>

SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
---
                <% @vorgaenger1 = aufgabe.id %>
                <% @nachfolger1 = Aufgaben.find(:all, :conditions => [ "aufgabenvorgaenger = ?", aufgabe.id]) %>