app/views/produkts/index.html.erb

<% javascript_include_tag 'jquery_ujs' %>
<% @projekt = Projekt.find(:all, :conditions=>["id=?", @projektid]).first %>
---
SELECT `projekts`.* FROM `projekts` WHERE (id='1')

                          <% @vorgaenger2 = kategorie.id %>
                          <% @nachfolger2 = Produkt.find(:all, :conditions => [ "kat_id = ?", kategorie.id]) %>
---
SELECT `produkts`.* FROM `produkts` WHERE (kat_id=1)