app/views/verantwortlichkeitens/index.html.erb

        <% @aufgabeid= arbeitspaket.aufgabeid %>
        <% @aufgabe = Aufgaben.find(:all, :conditions=>["id=?", @aufgabeid]).first %>
---
SELECT `aufgabens`.* FROM `aufgabens` WHERE (id)

            <td style="text-align: center;vertical-align: middle;font-family: FontAwesome;font-weight: bold;">
              <% @lieferobjekt = Produkt.find(:all, :conditions=> ["id = ?", arbeitspaket.produkt_id]).first %>
---
SELECT `produkts`.* FROM `produkts` WHERE (id = NULL)

              <!--Vorgängername -->
              <% @vorgaenger = Arbeitspaketvorgaenger.find(:all,:conditions => [ "apid = ?", arbeitspaket.id]) %>
---
SELECT `arbeitspaketvorgaengers`.* FROM `arbeitspaketvorgaengers` WHERE (apid = 1)

                  <%@vorgaenger.each do |v| %>
                    <% @vorgaengername =Arbeitspaket.find(:all, :conditions => [ "id = ?", v.apvorgaengerid]) %>
                    <% if @vorgaengername.first  %>
                      <li   style="vertical-align: middle;font-family: FontAwesome;font-weight: bold;"><%= @vorgaengername.first.arbeitspaketname %></li>
---
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 1)
SELECT `arbeitspakets`.* FROM `arbeitspakets`

            <!-- Alle AP/Ress Beziehungen von AP -->
            <% @ressourcen = Verantwortlichkeiten.find( :all, :conditions => [ "arbeitspaketid = ?", arbeitspaket.id]) %>
---
SELECT `verantwortlichkeitens`.* FROM `verantwortlichkeitens` WHERE (arbeitspaketid = 1)

            <% @ressourcen.each do |res| %>
              <% @reso = Ressourcen.find(:all, :conditions=> ["id =?", res.ressourceid]) %>
---
SELECT `ressourcens`.* FROM `ressourcens` WHERE (id ='1')