app/views/aufgabens/index.html.erb

                <% @vorgaenger1 = aufgabe.id %>
                <% @nachfolger1 = Aufgaben.find(:all, :conditions => [ "aufgabenvorgaenger = ?", aufgabe.id]) %>
---
SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)