app/controllers/aufgabens_controller.rb

  def index
    if current_user.roleid == 1
      @projekts = Projekt.all
      if params[:id].nil?
        @projekt = Projekt.first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    else
      @projekts = Projekt.find(:all, :conditions => [ "projektleiter = ?", current_user.email])

      #Projekte wo Benutzer Als Ress zugeordnet ist
      #@eigene_ress_id = Ressourcen.find(:all, :conditions => ["ressourcename = ?", current_user.email ]).first
      #@eigene_verant = Verantwortlichkeiten.find(:all, :conditions => [ "ressourceid = ?", @eigene_ress_id] )
      #@eigene_verant.each do |ev|
      #  @eigene_ap = Arbeitspaket.find(:all, :conditions => [ "id=?", ev.arbeitspaketid ])
      #end
      #@projekts_mitwirkend = Projekt.find(:all, :conditions=> [""])


      if params[:id].nil?
        @projekt = Projekt.find(:all, :conditions => [ "projektleiter = ?", current_user.email]).first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    end



    @aufgaben = Aufgaben.all
    #@projekts = Projekt.all
    @arbeitspakets = Arbeitspaket.all
---
SELECT `projekts`.* FROM `projekts` WHERE (projektleiter = 'homer@pm.de')
SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
SELECT `arbeitspakets`.* FROM `arbeitspakets`