app/controllers/produkts_controller.rb

  def index
    @projektid = params[:projekt]
    @produktkats = Produktkategorie.find(:all, :conditions=>["projekt_id=?",@projektid])
    @produkte = Array.new


    @produktkats.each do |kat|
      @produkt = Produkt.find( :all, :conditions=>["kat_id=?", kat.id])
---
SELECT `produktkategories`.* FROM `produktkategories` WHERE (projekt_id='1')
SELECT `projekts`.* FROM `projekts` WHERE (id='1')
SELECT `produkts`.* FROM `produkts` WHERE (kat_id=1)