app/controllers/projekts_controller.rb

SELECT `projekts`.* FROM `projekts` WHERE (projektleiter = 'homer@pm.de')
SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
---
  def index

    if current_user.roleid ==1
      @projekts = Projekt.all
      if params[:id].nil?
        @projekt = Projekt.first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    else
      @projekts = Projekt.find(:all, :conditions=>["projektleiter=?", current_user.email])

      if params[:id].nil?
        @projekt = Projekt.find(:all, :conditions => [ "projektleiter = ?", current_user.email]).first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    end



    @tree = params[:view]


    @aufgaben = Aufgaben.all

SELECT `projekts`.* FROM `projekts` WHERE (id = '1')
SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 1)
---
   def pdfuebersicht
    if params[:id].nil?
    @projekt = Projekt.find(:all, :conditions => [ "projektleiter = ?", current_user.email]).first
  else
    @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
  end
    @projekts = Projekt.all
    @aufgaben = Aufgaben.all
    @arbeitspakets = Arbeitspaket.all

UPDATE `projekts` SET `projektstart` = '2014-01-15', `updated_at` = '2014-01-25 19:46:46' WHERE `projekts`.`id` = 1
---
  def update
    respond_to do |format|
      if @projekt.update(projekt_params)

SELECT `projekts`.* FROM `projekts` WHERE `projekts`.`id` = 1 LIMIT 1
---
    def set_projekt
      @projekt = Projekt.find(params[:id])