app/controllers/roadmaps_controller.rb

  def index



  if current_user.roleid ==1
      @projekts = Projekt.all
      if params[:id].nil?
        @projekt = Projekt.first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    else
      @projekts = Projekt.find(:all, :conditions=>["projektleiter=?", current_user.email])

      if params[:id].nil?
        @projekt = Projekt.find(:all, :conditions => [ "projektleiter = ?", current_user.email]).first
      else
        @projekt = Projekt.find(:all, :conditions => [ "id = ?", params[:id]]).first
      end
    end
@gantt = params[:view]

    @projekts = Projekt.all
    @aufgaben = Aufgaben.all
    @arbeitspakets = Arbeitspaket.all
    @arbeitspaketvorgaenger = Arbeitspaketvorgaenger.all
---
SELECT `projekts`.* FROM `projekts` WHERE (projektleiter = 'homer@pm.de')
SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 1)
SELECT `arbeitspaketvorgaengers`.* FROM `arbeitspaketvorgaengers` WHERE (apid = 1)