app/controllers/startsite_controller.rb

SELECT `ressourcens`.* FROM `ressourcens` WHERE (ressourcename = 'homer@pm.de')
SELECT `verantwortlichkeitens`.* FROM `verantwortlichkeitens` WHERE (ressourceid = NULL)
---
 	def startsite
		@arbeitspakets = Arbeitspaket.all
		@arbeitspaketvorgaengers = Arbeitspaketvorgaenger.all
		if current_user
			@eigene_ress_id = Ressourcen.find(:all, :conditions => ["ressourcename = ?", current_user.email ]).first
			@eigene_verant = Verantwortlichkeiten.find(:all, :conditions => [ "ressourceid = ?", @eigene_ress_id] )