app/controllers/verantwortlichkeitens_controller.rb

  def index
    @verantwortlichkeitens = Verantwortlichkeiten.all
    @ressourcens = Ressourcen.all
    @arbeitspakets = Arbeitspaket.all
    @arbeitspaketvorgaengers = Arbeitspaketvorgaenger.all


    if current_user.roleid == 1
      @projekts = Projekt.all
---
SELECT `verantwortlichkeitens`.* FROM `verantwortlichkeitens` WHERE (arbeitspaketid = 1)
SELECT `ressourcens`.* FROM `ressourcens` WHERE (id ='1')
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 1)
SELECT `arbeitspaketvorgaengers`.* FROM `arbeitspaketvorgaengers` WHERE (apid = 1)
SELECT `projekts`.* FROM `projekts` WHERE (projektleiter = 'homer@pm.de')