app/views/projekts/index.html.erb

SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
---
                  <% @vorgaenger1 = aufgabe.id %>
                  <% @nachfolger1 = Aufgaben.find(:all, :conditions => [ "aufgabenvorgaenger = ?", aufgabe.id]) %>