app/views/projekts/pdfuebersicht.html.erb

SELECT `arbeitspaketvorgaengers`.* FROM `arbeitspaketvorgaengers` WHERE (apid = 3)
SELECT `arbeitspakets`.* FROM `arbeitspakets` WHERE (id = 2)
---
      <% @aplist.each do |ap| %>
        <% @vorgaenger = Arbeitspaketvorgaenger.find(:all, :conditions => [ "apid = ?", ap]) %>
        <% if @vorgaenger.empty? %> <!-- Wenn kein Vorgaenger, dann Erste AP -->
            <% @erste_ap = Arbeitspaket.find(:all, :conditions => [ "id = ?", ap]) %>

SELECT `aufgabens`.* FROM `aufgabens` WHERE (aufgabenvorgaenger = 1)
---
                <% @vorgaenger1 = aufgabe.id %>
                <% @nachfolger1 = Aufgaben.find(:all, :conditions => [ "aufgabenvorgaenger = ?", aufgabe.id]) %>

SELECT `verantwortlichkeitens`.* FROM `verantwortlichkeitens` WHERE (arbeitspaketid = 1)
---
        <!-- Alle AP/Ress Beziehungen von AP -->
        <% @ressourcen = Verantwortlichkeiten.find( :all, :conditions => [ "arbeitspaketid = ?", arbeitspaket.id]) %>

SELECT `ressourcens`.* FROM `ressourcens` WHERE (id ='1')
---
        <% @ressourcen.each do |res| %>
          <% @reso = Ressourcen.find(:all, :conditions=> ["id =?", res.ressourceid]) %>